Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalTopBottomPlanesReversed Property
 Analytical Top Projection Plane is partially or completely below Analytical Bottom Projection Plane. Please reset top and/or bottom planes to valid values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalTopBottomPlanesReversed { get; }
Public Shared ReadOnly Property AnalyticalTopBottomPlanesReversed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalTopBottomPlanesReversed {
	FailureDefinitionId^ get ();
}
static member AnalyticalTopBottomPlanesReversed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace